#include <iostream>

int main(){

    //      Лекція по вказівниках


/* Основні поняття
Вказівник - це змінна, що містить адресу памʼяті.
Оператор & - використовується для отримння адреси памʼяті.
Оператор * - використовується для отримання значення, збереженого за адресою, що знаходиться у вказівнику.
*/

/*Оголошення та використання вкзаівників
Оголошення вказівників --  int* ptr;
Присвоєння вказівникам адреси памʼяті -- ptr = &variable;
Отримання значення, збереженого за адресою  -- int value = *ptr;
*/

/* Вказівники та масиви
Вказівники та індексація вказівників -- int arr[5]; int* ptr = arr;
Арифметика вказівників -- ptr++; ptr--; ptr+=n; ptr-=n;
*/

/* Вказівники та функції
Передача вказівників у функії -- void MyFunction(int* ptr);
Повернення вказівників у функцію -- int* Myfunction();
*/  

/* Вказівники на функції
Оголошення вказівників на функції -- int (*ptr)(int,int);
Передача вказівників на функції у функції -- void MyFunction(int (*ptr)(int,int));

*/

    return 0;
    
}