#include <iostream>

int main(){

    //      Лекція по вказівниках


/* Основні поняття
Вказівник - це змінна, що містить адресу памʼяті.
Оператор & - використовується для отримння адреси памʼяті.
Оператор * - використовується для отримання значення, збереженого за адресою, що знаходиться у вказівнику.
*/

/*Оголошення та використання вкзаівників
Оголошення вказівників --  int* ptr;
Присвоєння вказівникам адреси памʼяті -- ptr = &variable;
Отримання значення, збереженого за адресою  -- int value = *ptr;
*/

    return 0;
    
}